#+LAYOUT: docs-manual
#+TITLE: Clojure
#+SUMMARY: Enterprise grade magick.
#+TOC: true
#+ALIASES: clj, clojure, scicloj, cloj, CLJ, cljs, cljd

** Literate Programming

I'll be using [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-clojure.html][org-babel-clojure]] to write and run code within this
manual directly. Learning, remembering, and teaching now mix.

The [[https://en.wikipedia.org/wiki/Literate_programming][Literate programming]] idea has regained popularity these days in
the form of data notebooks, and it is certainly to my taste.

If the evaluated result is simple, it'll have a little arrow '=>'
beside it in the css, though not in the text document on disk.

*Like so:*

#+begin_src clojure
(+ 1 2 3 4 5)
#+end_src

#+RESULTS:
: 15

If the result is more complex, like a map, it'll be in a table and
it's tougher to target with css so I'll be lazy for now and leave it
sort of unstyled:

#+begin_src clojure
(vals {:a 1 :b 2})
(keys {:c 3 :d 4})
#+end_src

#+RESULTS:
| (1 2)   |
| (:c :d) |

...that's OK.

*** Control Flow

Enabled with if, cond, when, when-not, and other functions.

#+begin_src clojure
(def boolean-value true)

(if boolean-value "It's true!" "Lol nope")
(when boolean-value "Yes")
z(when-not boolean-value "Nope")
#+end_src

#+RESULTS:
| #'org.core/boolean-value |
| "It's true!"             |
| "Yes"                    |

*When* allows you to execute a form when a value is true and not provide
a false-case like an if statement.

*** Assignments

Use *def* to bind names in Clojure. 

#+begin_quote
Notice that I’m using the term *bind*, whereas in other languages you’d
say you’re assigning a value to a variable. Those other languages
typically encourage you to perform multiple assignments to the same
variable.

However, changing the value associated with a name like this can make
it harder to understand your program’s behavior because it’s more
difficult to know which value is associated with a name or why that
value might have changed. Clojure has a set of tools for dealing with
change, which you’ll learn about in Chapter 10. As you learn Clojure,
you’ll find that you’ll rarely need to alter a name/value association.
#+end_quote

#+begin_src clojure
(def status :my-body-is-ready)
#+end_src

#+RESULTS:
: #'org.core/status

*** Types

#+begin_src clojure
  {:numbers [ 1 2/3 4.5 ]
   :strings ["Yep" "With escapes! -> \""] }
#+end_src

#+RESULTS:
| :numbers | (1 2/3 4.5) | :strings | (Yep With escapes! -> ") |

#+begin_src clojure
:keywords
'symbols
#+end_src

**** Maps

*get* allows you to grab keys, and can return nil or a default:

#+begin_src clojure
(get {:x 1 :y 2} :y)   ;; => 2
(get {:x 1 :y 2} :z)   ;; => nil
(get {:x 1 :y 2} :z 3) ;; => 3
#+end_src

*get-in* allows you to dig into nested maps:

#+begin_src clojure
(get-in 
  {:head 1 :chest {:ribs 10 :cavity {:heart "pumpin'" :lungs 2}}} 
  [:chest :cavity :heart])
#+end_src

#+RESULTS:
: pumpin'

You can use a map like a function:

#+begin_src clojure
({:what "in" :tar "nation?"} :tar)
#+end_src

#+RESULTS:
: nation?

...and *keywords* can be used the same way with a few data structures:

#+begin_src clojure
(:tar {:what "in" :tar "nation?"})
#+end_src

#+RESULTS:
: nation?

#+begin_src clojure
(:far {:what "in" :tar "nation?"} "no far")
#+end_src

#+RESULTS:
: no far

**** Sets

[[https://www.braveclojure.com/do-things/#Sets][Brave Clojure: Sets]]

#+begin_src clojure
(def hs1 #{"this is a hash-set" 19 :testing})
#+end_src

A hash set can only store unique values. Using *conj* to add to a
hash-set will combine unique values.

#+begin_src clojure
(conj hs1 19)
#+end_src

#+RESULTS:
: #{"this is a hash set" 19 :testing}

#+begin_src clojure
(hash-set 1 2 3 4 1 2 3 4 5 6)
(set [1 2 3 4 1 2 3]) 
#+end_src

#+RESULTS:
| #{1 4 6 3 2 5} |
| #{1 4 3 2}     |

Use *get* and *contains?* with hash sets:

#+begin_src clojure
(contains? hs1 18)
(contains? hs1 19)
(get hs1 18) ;; => nil
(get hs1 19)
#+end_src

#+RESULTS:
| false |
| true  |
| 19    |

